In [119]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [120]:
df = pd.read_csv('titanic.csv')

In [121]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [122]:
ddf = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked','Survived'],axis='columns')

In [123]:
ddf

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [124]:
sur = df['Survived']

In [125]:
sur

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [126]:
from sklearn.preprocessing import LabelEncoder

In [164]:
le_Sex = LabelEncoder()

In [128]:
ddf['Sex_n'] = le_pclass.fit_transform(ddf['Sex'])

In [129]:
inputs = ddf.drop(['Sex'],axis='columns')

In [130]:
nan_mask = inputs[inputs.isna().any(axis=1)]
print("NaN mask: ")
print(nan_mask)

NaN mask:
     Pclass  Age     Fare  Sex_n
5         3  NaN   8.4583      1
17        2  NaN  13.0000      1
19        3  NaN   7.2250      0
26        3  NaN   7.2250      1
28        3  NaN   7.8792      0
..      ...  ...      ...    ...
859       3  NaN   7.2292      1
863       3  NaN  69.5500      0
868       3  NaN   9.5000      1
878       3  NaN   7.8958      1
888       3  NaN  23.4500      0

[177 rows x 4 columns]

In [134]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [135]:
inputs

     Pclass        Age     Fare  Sex_n
0         3  22.000000   7.2500      1
1         1  38.000000  71.2833      0
2         3  26.000000   7.9250      0
3         1  35.000000  53.1000      0
4         3  35.000000   8.0500      1
..      ...        ...      ...    ...
886       2  27.000000  13.0000      1
887       1  19.000000  30.0000      0
888       3  29.699118  23.4500      0
889       1  26.000000  30.0000      1
890       3  32.000000   7.7500      1

[891 rows x 4 columns]

In [136]:
from sklearn import tree

In [137]:
model = tree.DecisionTreeClassifier()

In [138]:
from sklearn.model_selection import train_test_split

In [140]:
x_train, x_test, y_train, y_test = train_test_split(inputs,sur,test_size = 0.4)

In [165]:
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [166]:
model.score(x_test,y_test)

0.7338935574229691

In [167]:
model.predict([[2,27,13,1]])

C:\Users\sunam\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)